Tekla Open API Reference for Tekla Structures 2025
InsidePartHorizontalOrWithLeaderLinePlacingType Constructor
 Creates a new inside part horizontal or with leader line placing type instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public InsidePartHorizontalOrWithLeaderLinePlacingType()
Public Sub New
See Also
Reference
InsidePartHorizontalOrWithLeaderLinePlacingType Class
Tekla.Structures.Drawing Namespace